#ifndef JULIA_H
#define JULIA_H
#include "map"

/**
 * @brief Зберігає параметри для генерації множини Жуліа та створює вікно для їх
 *        налаштування.
 */
class Julia
{
    /**
     * @brief Мінімальне значення по осі X та по осі Y.
     */
    float minValue[2];
    /**
     * @brief Максимальне значення по осі X та по осі Y.
     */
    float maxValue[2];
    /**
     * @brief Максимальна кількість ітерацій яку потрібно виконати,
     *        перед тим як вважати що ми знаходимося за множиною Жуліа.
     */
    int maxIterations;
    /**
     * @brief Вважаємо що, якщо норма комплексного числа вишла за це число,
     *        то ми знаходимося за множиною Жуліа.
     *
     * Це число означає що всі значення норми вище за це ми будемо вважати
     * безкінечністью.
     */
    float infinityBorder;
    /**
     * @brief Початкове значення комплексного числа `z`.
     */
    float z[2];
public:
    /**
     * @brief Сторює клас із начальними параметрами.
     * За замовчанням виставлено:
     * * коодинатна сітка у діапазонах [-2, 2] по обом
     * осям,
     * * максимальна кількіст ітерацій 50,
     * * границя переходу у безкінечність 10.
     */
    Julia();
    /**
     * @brief Забираємо мінімальні значення по обом осям.
     * @return массив із мінімальни значеннями
     */
    const float *getMin() const;
    /**
     * @brief Забираємо максимальними значення по обом осям.
     * @return массив із мксимальними значеннями
     */
    const float *getMax() const;
    /**
     * @brief Забираємо максимальну кількість ітерацій.
     * @return максимальна кількість ітерацій
     */
    int getMaxIterations() const;
    /**
     * @brief забираємо границю переходу у безкінечність.
     * @return границя переходу у безкінечність
     */
    float getInfinityBorder() const;
    /**
     * @brief забираємо початкове значення комплексного числа `z`
     * @return значення комплексного числа `z`
     */
    const float *getZ() const;
    /**
     * @brief Перетворює координати пікселів у координати множини Жуліа.
     * @param x номер пікселя по осі X
     * @param y номер пікселя по осі Y
     * @param size розмір картинки
     * @return координати множини Жуліа
     */
    std::pair<float, float> getCoords(int x, int y, const int size[2]) const;
    /**
     * @brief Створює вікно для редагування параметрів.
     * @return перевірка, чи були змінені параметри у класі.
     */
    bool imConfig();
};

#endif // JULIA_H
